Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །བྱང་ཆུབ་སེམས་དཔའ་རྟོགས་པར་བྱེད།
en: “The bodhisattvas who realize

source: །སངས་རྒྱས་ཡེ་ཤེས་རྟོགས་བྱེད་པས།
en: The highest wisdom of buddhahood,

source: །སངས་རྒྱས་ཞེས་ཀྱང་དེ་ཕྱིར་བརྗོད།
en: Because of that are called buddhas, As they have realized buddhahood’s wisdom. {15}

source: །དངོས་མེད་སྨོན་པ་མེད་པ་དང་། །མཚན་མ་མེད་དང་སྟོང་པ་ཉིད།
en: “The absence of existents, the absence of aspiration, The absence of attributes, and emptiness—

source: །རྣམ་ཐར་སྒོ་ནི་འདི་དག་གིས།
en: It is these doorways to liberation

source: །སྒོ་དག་སངས་རྒྱས་རབ་ཏུ་སྟོན།
en: That the Buddha taught as doorways. {16}

source: །མིག་དང་རྣ་བ་སྣ་དག་དང་། །ལྕེ་དང་ལུས་དང་དེ་བཞིན་ཡིད།
en: “The eyes, the ears, and the nose, The tongue, the body, and likewise the mind, The buddhas have explained

source: །དེ་དག་རང་བཞིན་སྟོང་པར་ནི། །སངས་རྒྱས་དག་གིས་རབ་ཏུ་བཤད། །དེ་ལྟ་བུ་ཡི་ཆོས་རྣམས་ཀྱི།
en: That they are by nature empty. {17}

source: །རང་བཞིན་དག་ནི་སུས་ཤེས་པ།
en: “They who know in that way The nature of phenomena,

source: །ཆོས་ཀྱི་མཚན་ཉིད་ཤེས་པས་ན།
en: Knowing the characteristics of phenomena,

source: །དེ་ནི་རྩོད་པར་མི་བྱེད་དོ།
en: They will not be in disagreement with it. {18}

source: །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་དག །དཔའ་བོ་སྐྱོབ་པའི་སྤྱོད་ཡུལ་ཏེ།
en: “This is the realm of experience of the heroes, Of the bodhisattvas, the protectors.

source: །ཆོས་རྣམས་སྟོང་པར་ཤེས་པ་ནི།
en: They know the emptiness of phenomena

source: །དེ་དག་ནམ་ཡང་ནེམ་ནུར་མེད།
en: And they never have any doubt. {19}

source: །ཆོས་ཀྱི་རང་བཞིན་ཤེས་པས་ན།
en: “Those who know the nature of phenomena,

source: །དེ་ཕྱིར་སངས་རྒྱས་ཞེས་བྱ་སྟེ།
en: Those ones are called a buddha.

source: །སེམས་ཅན་བསམ་གྱིས་མི་ཁྱབ་ཅིང་།
en: They guide countless, innumerable

source: །དཔག་ཏུ་མེད་པ་བྱང་ཆུབ་འདུལ།
en: Beings to enlightenment. {20}

source: །སངས་རྒྱས་སྒྲས་ནི་གང་བྱས་པ།
en: “That which is accomplished by the word buddha

source: །ཚུལ་ཁྲིམས་སྒྲས་ཀྱང་དེ་བྱས་ཏེ།
en: Is also accomplished by the words correct conduct.

source: །སངས་རྒྱས་སྒྲ་དང་ཚུལ་ཁྲིམས་སྒྲ།
en: The words buddha and correct conduct

source: །དེ་དག་གཉི་ག་མཚན་ཉིད་གཅིག །འཇིག་རྟེན་སྒྲ་དག་བརྗོད་པ་ནི།
en: Have the same characteristic. {21} “However many words are spoken

source: །རབ་དང་འབྲིང་དང་ཐ་མ་རྣམས།
en: Whether superior, middling, or lesser,

source: །མཉམ་པར་གཞག་པའི་སྒྲ་གཅིག་ལ།
en: They are all taught in the one word meditation,

source: །སངས་རྒྱས་སྒྲས་ནི་བསྟན་པ་ཡིན།
en: And in the one word buddha. {22}

source: །སངས་རྒྱས་སྒྲ་ནི་ཡུལ་མི་གནས།
en: “The Buddha’s Dharma is stated

source: །ཕྱོགས་ལའང་གནས་པ་མ་ཡིན་རྗོད།
en: To have no location and no direction.

source: །སྐྱེས་དང་འགགས་པ་མ་ཡིན་ཏེ།
en: It has no birth and no cessation.

source: །དེ་བཞིན་གཅིག་དང་ཐ་དད་མིན།
en: Neither is it single nor multiple. {23}

source: །དེ་དག་གསར་རམ་རྙིང་མ་ཡིན།
en: “It is not new and it is not old.

source: །དེ་དག་ལ་ནི་རློམ་སེམས་མེད།
en: There is nothing to be proud of.

source: །སེར་པོ་མ་ཡིན་སྔོན་པོ་མིན།
en: It is not blue and it is not yellow;

source: །དཀར་པོ་མ་ཡིན་དམར་པོ་མིན།
en: Neither is it white, nor red. {24} “That which is taught through verses

source: །བརྗོད་དུ་མེད་ཅིང་གཟུང་མེད་པར། །དེ་ལྟར་དབྱངས་ཀྱིས་བསྟན་མོད་ཀྱི། །དེ་ནི་དབྱངས་ཀྱི་ས་མ་ཡིན།
en: Is inexpressible and ungraspable.

source: །ཐུབ་པ་དག་གི་ཆོ་འཕྲུལ་འདི།
en: This miraculous activity of the Sage Is beyond the level of verses. {25} {26}

source: །སངས་རྒྱས་མྱ་ངན་འདས་པ་ཡི།
en: “The buddha who has passed into nirvāṇa

source: །སངས་རྒྱས་སྐུ་གཟུགས་སྣང་གྱུར་ཏེ།
en: Is seen in the form of a buddha.

source: །དེ་གནས་ཡིད་ལ་བྱས་པ་ན།
en: The one who imagines that he is present

source: །ཆོ་འཕྲུལ་རྣམས་ཀྱང་དེ་ཡིས་མཐོང་།
en: Will also see the buddha’s miracles. {27}

source: །གང་གིས་མྱ་ངན་འདས་རེག་པ།
en: “When someone has reached nirvāṇa

source: །སེམས་ཅན་དེ་ནི་མི་རྙེད་དེ།
en: There is no being that is to be found.

source: །དེ་བཞིན་ཆོས་རྣམས་རབ་བསྟན་ཅིང་།
en: That is how the Dharma is taught

source: །སེམས་ཅན་མང་པོ་གྲོལ་བར་བྱས།
en: And many beings are liberated. {28}

source: །ཇི་ལྟར་ཉི་མ་ཟླ་བ་དག །ཁར་བའི་སྣོད་དུ་སྣང་བ་ཡང་།
en: “Just as the sun and moon Appear in a bronze bowl

source: །རང་གི་གཟུགས་ནི་མི་འཕོ་ལྟར།
en: Without their own form going there,

source: །ཆོས་ཀྱི་མཚན་ཉིད་དེ་འདྲའོ། །ཆོས་རྣམས་མིག་ཡོར་ལྟ་བུར་ཡང་།
en: Such is the nature of phenomena. {29}

source: །གང་གིས་ངོ་བོ་ཉིད་ཤེས་པ།
en: “Those who know the nature

source: །དེ་དག་གཟུགས་ཀྱི་ལུས་སུ་ནི།
en: Of phenomena to be like reflections,

source: །སངས་རྒྱས་སྐུ་ལ་མི་བལྟའོ།
en: They do not see the Buddha’s body As being a body of form. {30}

source: །ཆོས་འདི་ལུས་གཟུགས་མེད་པ་སྟེ།
en: “This phenomenon has no body;

source: །འདི་ལ་ལུས་གཟུགས་གང་ཡང་མེད།
en: There is no body in it at all.

source: །ཆོས་གང་ལུས་གཟུགས་མེད་པ་ནི།
en: A phenomenon has no body,

source: །དེ་ནི་སངས་རྒྱས་སྐུ་ལུས་སོ།
en: And that is the body of the Buddha. {31}

source: །སུ་དག་ཆོས་ཀྱི་སྐུར་ལྟ་བ།
en: “Those who see the dharmakāya,

source: །དེ་དག་གིས་ནི་འདྲེན་པ་མཐོང་།
en: They are the ones who see the Guide.

source: །རྫོགས་པའི་སངས་རྒྱས་ཆོས་ཀྱི་སྐུ།
en: The dharmakāyas are the buddhas.

source: །དེ་ནི་རྫོགས་པའི་སངས་རྒྱས་མཐོང་།
en: That is seeing the buddhas. {32}

source: །རྟེན་ཅིང་སོ་སོར་བསྟན་པ་སྟེ།
en: “That which is specified through dependence

source: །སོ་སོ་མ་ཡིན་སོ་སོར་བཤད།
en: Is specified to not be specific.

source: །དགེ་སྦྱོང་ཉིད་ནི་སུ་འདོད་པ།
en: Those who wish to be renunciants

source: །འཇུག་པ་འདི་ནི་རིག་པར་གྱིས།
en: Should understand this approach. {33} {34}

source: །གང་དག་བདག་གིས་ཐོབ་སྙམ་པ། །དེ་ཕྱིར་མ་ཐོབ་པ་ཞེས་བྱ།
en: “Whoever thinks, ‘I have attained,’ Is for that reason said to be without attainment. The one who is said to be a renunciant

source: །གང་གིས་དགེ་སྦྱོང་ཉིད་མ་ཐོབ། །དེ་ཕྱིར་དགེ་སྦྱོང་ཞེས་ཀྱང་བྱ།
en: Is the one who thinks, ‘I have not attained renuncation.’ {35}

source: །སུ་དག་བསླབས་པར་མ་གྱུར་པ། །ཟབ་མོའི་ཆོས་འདི་ག་ལ་སྨྲ།
en: “Those who have not learned this profundity, How can they teach the Dharma?

source: །དེ་དག་ཟབ་མོའི་མིང་དུ་ཡང་། །ཡོངས་སུ་བརྗོད་པར་མི་ནུས་སོ།
en: They cannot describe it Through using profound words. {36}

source: །ཕུང་པོ་ལྔ་ནི་དངོས་མེད་དེ།
en: “The five skandhas are insubstantial.

source: །མེད་པ་ལས་ནི་འདི་དག་བྱུང་།
en: Being nonexistent they arise.

source: །སུ་ཡི་ཕུང་པོ་བྱུང་བ་ཡང་།
en: For the one to whom the skandhas arise,

source: །དེ་ལ་སློང་བར་བྱེད་པ་མེད།
en: There is nothing that arises. {37}

source: །ཕུང་པོའི་མཚན་ཉིད་གང་ཡིན་པ།
en: “Those characteristics of the skandhas

source: །ཆོས་ཀུན་དེ་ཡི་མཚན་ཉིད་ཡིན།
en: Are the characteristics of all phenomena.

source: །དེ་ཡི་མཚན་ཉིད་ཡོད་བཤད་དེ།
en: Those characteristics are taught

source: །མཚན་ཉིད་ཀྱང་ནི་ཡོད་མ་ཡིན།
en: But there are no characteristics that exist. {38} “The characteristic of phenomena

source: །ཇི་ལྟར་བར་སྣང་ནམ་མཁའ་བཞིན། །ཆོས་ཀྱི་མཚན་ཉིད་དེ་འདྲ་བར།
en: Is the same as that of space and sky,

source: །སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ།
en: As seen in the past, the future,

source: །ད་ལྟར་བྱུང་བའང་མཐོང་བར་འགྱུར།
en: And as in the present. {39}

source: །ནམ་མཁའ་གཟུང་བ་མེད་པར་བཤད།
en: “Space is taught to be ungraspable;

source: །དེ་ལ་གཟུང་བ་མི་རྙེད་དེ།
en: There is nothing there to be grasped.

source: །ཆོས་ཀྱི་རང་བཞིན་འདི་ཉིད་ཡིན།
en: That is the nature of phenomena:

source: །གཟུང་བ་མེད་པ་ནམ་མཁའ་འདྲ།
en: It is ungraspable like space. {40}

source: །དེ་ལྟ་བུར་ནི་ཆོས་བསྟན་ཏེ།
en: “That is how phenomena are taught,

source: །དེ་ལ་གང་ཡང་མཐོང་བ་མེད།
en: That there is nothing to be seen.

source: །སུ་དག་ཆོས་འདི་མི་མཐོང་བ།
en: For the one who does not see phenomena,

source: །དེ་ཡི་ཆོས་རྣམས་བསམ་མི་ཁྱབ།
en: Phenomena are beyond conception. {41}

source: །ཆོས་འདི་རྣམས་ནི་རང་བཞིན་མེད།
en: “These phenomena have no nature;

source: །འདི་དག་རང་བཞིན་མི་རྙེད་དེ།
en: They have no nature to be found.

source: །སངས་རྒྱས་བྱང་ཆུབ་སུ་བརྩོན་པ།
en: For those dedicated to buddhahood’s enlightenment

source: །རྣལ་འབྱོར་པ་ཡི་སྤྱོད་ཡུལ་འདི།
en: This is the domain of the yogin. {42}

source: །དེ་ལྟ་བུར་ནི་སུས་ཤེས་པ།
en: “The ones who know phenomena in that way

source: །དེ་ནི་ཆོས་ལ་མི་ཆགས་ཏེ།
en: Will not have attachment to phenomena.

source: །ཆོས་རྣམས་ལ་ཡང་མི་ཆགས་པས།
en: Not being attached to phenomena,

source: །ཆོས་ཀྱི་འདུ་ཤེས་རབ་ཏུ་རྟོགས།
en: They understand the conceptualization of phenomena. {43}

source: །བྱང་ཆུབ་སེམས་དཔའ་སྐྱོབ་པ་ཡིས།
en: “The bodhisattvas, the protectors,

source: །ཆོས་རྣམས་ཐམས་ཅད་རྣམ་པར་བཤིག །ཆོས་ཀྱི་འདུ་ཤེས་རྣམ་བཤིག་ནས།
en: Have annihilated all phenomena. Having annihilated the conceptualization of phenomena

source: །སངས་རྒྱས་ཆོས་ལ་རློམ་སེམས་མེད།
en: They do not become proud in the Buddha’s Dharma. {44}

source: །མཐའ་དེ་རློམ་སེམས་མ་བྱས་པ།
en: “Having no pride in that preeminence,

source: །བརྟགས་ནས་མཐར་ནི་བཤད་པ་སྟེ།
en: They examine and teach that preeminence.

source: །དེ་ལྟར་མཐའ་ནི་སུས་ཤེས་པ།
en: The ones who know that preeminence

source: །བསྐལ་པ་བྱེ་བར་རློམ་སེམས་མེད།
en: Will have no pride throughout ten million eons. {45}

source: །བྱིས་པས་སྔོན་གྱི་མཐའ་བརྟགས་པས།
en: “The foolish examine that preeminence

source: །འཁོར་བ་རྣམས་སུ་འཁོར་འགྱུར་ཏེ།
en: And subsequently continue in saṃsāra. It has no location that can be found

source: །ཕྱོགས་བཅུ་དག་ཏུ་བཙལ་ན་ཡང་། །དེ་ཡི་གནས་ནི་མི་རྙེད་དོ།
en: Even though one searches throughout the ten directions. {46}

source: །འཁོར་བ་སྟོང་པར་རིག་ནས་ནི།
en: “The bodhisattva, knowing emptiness,

source: །རྒྱལ་བའི་ཐུགས་སྲས་ཆགས་མི་འགྱུར།
en: Has no attachment to saṃsāra.

source: །བྱང་ཆུབ་དོན་ཕྱིར་སྤྱོད་མོད་ཀྱི།
en: They practice to attain enlightenment

source: །དེ་དག་སྤྱོད་པ་མི་རྙེད་དོ།
en: But their practice cannot be found. {47} “Their passage cannot be found,

source: །ནམ་མཁའ་ལ་ནི་བྱ་རྗེས་བཞིན།
en: Like that of a bird through the sky.

source: །དེ་དག་རྙེད་པར་མི་འགྱུར་ཏེ།
en: The bodhisattvas realize

source: །དེ་འདྲའི་རང་བཞིན་བྱང་ཆུབ་དེ། །བྱང་ཆུབ་སེམས་དཔས་རྟོགས་པར་འགྱུར།
en: That nature of enlightenment. {48}

source: །སྒྱུ་མ་བྱེད་པ་རབ་བསླབས་པ།
en: “Just as a well-trained conjurer

source: །སྒྱུ་མ་དག་ནི་སྟོན་པ་ལྟར།
en: Is able to display illusions,

source: །རྣམ་པ་སྣ་ཚོགས་གཟུགས་རྣམས་ཀྱང་།
en: Although there are many kinds of forms

source: །གཟུགས་ནི་དམིགས་པར་མི་འགྱུར་རོ།
en: There is no form that can be grasped. {49}

source: །རྙེད་དང་མི་རྙེད་རློམ་སེམས་མེད།
en: “There is no pride in acquisition or nonacquisition,

source: །རྙེད་པ་ལ་ཡང་རྙེད་མེད་དེ།
en: As there is no acquisition in acquisition.

source: །ཡེ་ཤེས་དེ་ནི་སྒྱུ་མ་འདྲ།
en: That wisdom is like an illusion,

source: །སྒྱུ་མ་དེ་ལ་གནས་པ་མིན།
en: And that illusion has no location. {50} “Thus the understanding of fools

source: །དེ་བཞིན་ཆོས་རྣམས་སྟོང་པ་ལ། །བྱིས་པའི་བློ་ཡིས་རྣམ་བརྟགས་ནས།
en: Is a conceptualization of empty phenomena.

source: །རྣམ་པར་རྟོག་ལ་སྤྱོད་པ་དག །འགྲོ་བ་དྲུག་ཏུ་གཞོལ་བར་འགྱུར།
en: Engaging in conceptualization, They are doomed to the six existences. {51}

source: །ཕུང་པོ་སྐྱེ་རྒ་ཉེར་འགྲོ་སྟེ།
en: “Beings undergo rebirth and aging;

source: །དེ་དག་སྐྱེ་བ་ཟད་མི་འགྱུར།
en: There is no end to their being reborn.

source: །སྐྱེ་ཞིང་འཆི་བའི་ཕུང་པོ་རྣམས། །དེ་དག་སྡུག་བསྔལ་མཐའ་ཡས་སོ།
en: There is no end to the suffering Of skandhas that are born and die. {52}

source: །སྐྱེ་ཞིང་འཁོར་བ་སྡུག་བསྔལ་ཏེ།
en: “The suffering of birth and saṃsāra

source: །བྱིས་པའི་བློ་ཡིས་བརྟགས་པས་ན།
en: Is the conceptualization of foolish understanding.

source: །དེ་དག་རྟོག་པ་མི་ཟད་དེ།
en: This does not cease throughout eons;

source: །དེ་དག་བསྐལ་པ་བྱེ་བར་འཁོར།
en: Beings continue in saṃsāra for millions of eons. {53}

source: །མི་སྦྱོར་བ་དང་རབ་སྦྱོར་དང་། །ལས་ཀྱི་སྦྱོར་ལ་གང་གནས་དང་། །ལས་རྣམས་ལེན་པ་གང་དགའ་བ།
en: “They continue in the performance of activities, Whether that of engagement or disengagement. They delight in the actions they perform,

source: །དེ་དག་ལས་ལས་མི་འཐར་རོ།
en: But those activities will not liberate them. {54}

source: །ལས་ཀྱི་ཆུ་བོས་ཁྱེར་བ་དེ།
en: “They are carried along on a river of actions,

source: །ལས་ནི་རྟག་ཏུ་ཟད་མི་འགྱུར། །བདུད་ཀྱི་ཕྱོགས་ལ་གང་གནས་པ།
en: And their actions will have no end.

source: །ཡང་དང་ཡང་ནི་འཆི་བར་འགྱུར།
en: They will die over and over, Always dwelling in the realm of the māras. {55}

source: །བདུད་ཀྱིས་ཟིལ་ནོན་ཤེས་རབ་འཆལ།
en: “Overpowered by the māras, with poor understanding,

source: །ཉོན་མོངས་པ་ཡི་ལས་རྣམས་ཀྱིས།
en: They act through being afflicted by the kleśas.

source: །སྐྱེ་བ་དེ་དང་དེ་དག་ཏུ། །སྐྱེ་ཞིང་འཆི་བ་མྱོང་བར་འགྱུར།
en: They experience births and deaths That take place in various worlds. {56}

source: །སོ་སོའི་སྐྱེ་བོ་ལོང་བ་ཡི།
en: “Those various beings who are blind fools,

source: །བྱིས་པ་དེ་དག་འཆི་བར་འགྱུར།
en: They proceed toward death.

source: །དེ་དག་བཏག་ཅིང་རྣམ་པར་གཞོམ།
en: They are killed and destroyed,

source: །དེ་དག་འགྲོ་བ་མི་བཟད་འགྱུར།
en: And their existences are terrible. {57}

source: །བྱིས་པའི་བློ་ཅན་མཚོན་ཆ་ཡིས།
en: “Those with foolish understanding

source: །གཅིག་ལ་གཅིག་ནི་གསོད་པ་བྱེད།
en: Kill each other with weapons. By continuing with that kind of activity

source: །དེ་ལྟ་བུར་ནི་སྦྱོར་བ་དག །དེ་དག་སྦྱོར་བ་རབ་ཏུ་འཕེལ།
en: Their sufferings only increase. {58}

source: །ངའི་བུ་ང་ཡི་ནོར་སྙམ་དུ། །བྱིས་པའི་བློ་ཡིས་རབ་བརྟགས་ཏེ།
en: “Those with foolish understanding think, ‘My sons’ and ‘my wealth.’

source: །མེད་པའི་ཆོས་རྣམས་བརྟགས་པས་ན།
en: They conceive of that which has no existence

source: །འཁོར་བ་དག་ནི་ཕྱིར་ཞིང་འཕེལ།
en: And thereby continue to extend saṃsāra. {59}

source: །འཁོར་བ་དག་ནི་འཕེལ་བྱེད་ཅིང་།
en: “They who extend saṃsāra,

source: །སོ་སོའི་སྐྱེ་བོ་དེ་དག་འཁོར།
en: Those individuals continue in saṃsāra.

source: །སོ་སོ་ཐ་དད་འགྲོ་བས་ན།
en: They each go their individual ways

source: །སོ་སོའི་སྐྱེ་བོར་བརྗོད་པ་ཡིན།
en: And therefore they are called individual beings. {60}

source: །སངས་རྒྱས་བསྟན་པ་བོར་ནས་ནི།
en: “They reject the Buddha’s teaching

source: །ཆོས་རྣམས་མང་པོ་རབ་ཏུ་འཆད།
en: And teach numerous other doctrines.

source: །བདུད་ཀྱི་དབང་དུ་སོང་བས་ན།
en: They are under the power of Māra

source: །དེ་དག་ཐར་པ་རྙེད་མི་འགྱུར།
en: And they will not attain liberation. {61}

source: །འདོད་པའི་ཕྱིར་ནི་བྱིས་པ་རྣམས།
en: “These fools, because of their desires,

source: །བུད་མེད་རུལ་ལ་སྟེན་བྱེད་དེ།
en: Have intercourse with putrid women.

source: །འགྲོ་བ་རུལ་བར་འགྲོ་འགྱུར་ཞིང་། །དེས་ནི་ངན་འགྲོར་ལྟུང་བར་འགྱུར།
en: They will be reborn as putrid beings, Falling into the lower realms as a result. {62} “The buddhas praise neither desire, Nor having intercourse with women.

source: །འཇིགས་པ་ཆེན་པོའི་ཞགས་པ་ནི། །བུད་མེད་ཞགས་པ་མི་བཟད་པས།
en: That is a terrifying noose, The dreadful noose of women. {63} “Those who are wise avoid it Like a vicious poisonous snake.

source: །སངས་རྒྱས་རྣམས་ཀྱིས་འདོད་པ་དང་། །བུད་མེད་བསྟེན་པའང་མ་བསྔགས་སོ། །ལམ་འདི་བྱང་ཆུབ་མི་འགྱུར་བས། །བུད་མེད་རྣམས་ལ་མ་རྟོན་པར། །སྦྲུལ་གདུག་ཤིན་ཏུ་ཁྲོ་བོ་ལྟར། །མཁས་པས་དེ་ནི་རྣམ་པར་སྤོང་། །སངས་རྒྱས་ཀུན་གྱིས་བསྟན་པ་ཡི།
en: They do not put their trust in women. That is not the path to enlightenment. {64}

source: །བྱང་ཆུབ་ལམ་ལ་སྒོམ་པར་བྱེད།
en: “They meditate on the path to enlightenment That has been taught by all the buddhas.

source: །ལམ་དེ་གོམས་པར་བསྒོམས་བྱས་ན།
en: Having meditated on that path

source: །བླ་མེད་སངས་རྒྱས་འགྲུབ་པར་འགྱུར།
en: They become unsurpassable buddhas. {65}

source: །དེ་དག་བླ་ན་མེད་འགྱུར་ཏེ།
en: “Those who have become unsurpassable

source: །འཇིག་རྟེན་གྱི་ནི་མཆོད་རྟེན་འགྱུར།
en: Become shrines in the world.

source: །བླ་ན་མེད་པའི་ཡེ་ཤེས་ཀྱིས།
en: With unsurpassable wisdom

source: །སངས་རྒྱས་བླ་ན་མེད་པར་འགྱུར།
en: They become unsurpassable buddhas. {66}

source: །གསོ་སྦྱོང་དག་ལ་སྙེན་བྱེད་ཅིང་།
en: “They follow the poṣadha vows

source: །ཚུལ་ཁྲིམས་ཕུང་པོར་ཡང་དག་འཛུད། །སེམས་ཅན་བྱེ་བ་བསམ་མི་ཁྱབ།
en: And follow the path of correct conduct.

source: །བྱང་ཆུབ་ཏུ་ཡང་ཡང་དག་འཛུད།
en: They lead toward enlightenment

source: །དེ་དག་སེམས་ཅན་རྣམས་ཀྱི་ནི།
en: Countless millions of beings. {67}

source: །བསམ་ཡས་དཔག་མེད་དོན་བྱེད་དེ།
en: “They accomplish the benefit of Innumerable, countless beings.

source: །དཔའ་བོ་ཤེས་རབ་ཆེན་པོ་དེ།
en: They are heroes with great wisdom

source: །བདུད་རྩི་ཡི་ནི་རྔ་ཡང་རྡུང་།
en: Who beat the drum of deathlessness. {68}

source: །བདུད་ཀྱི་གནས་རྣམས་གཡོ་བྱེད་ཅིང་།
en: “They make the realm of Māra shudder;

source: །བདུད་ཀྱི་རིས་ཀྱང་གཡོ་བར་བྱས།
en: They make the māras shake. They lead to enlightenment

source: །བདུད་རྣམས་བྱེ་བ་བསམ་མི་ཁྱབ། །བྱང་ཆུབ་ལ་ནི་ཡང་དག་འཛུད།
en: Countless millions of māras. {69}

source: །ཕ་རོལ་རྒོལ་བ་ཚར་གཅོད་ཅིང་།
en: “They overcome their opponents.

source: །མུ་སྟེགས་ཅན་ནི་ཕམ་པར་བྱེད།
en: They defeat the tīrthikas. They shake the entire earth

source: །རི་དང་རྒྱ་མཚོར་བཅས་པ་ཡི། །ས་ཡང་རབ་ཏུ་གཡོ་བར་བྱེད། །ཁྱུ་མཆོག་གྱུར་པ་དུ་མ་ཡིས།
en: With its mountains and oceans. {70} “The great leaders through many transformations

source: །ལུས་ཀྱི་རྣམ་པར་འཕྲུལ་བྱེད་ཅིང་།
en: Manifest miraculous manifestations of the body.

source: །ཤེས་རབ་ཆེན་པོ་དེ་དག་ནི།
en: The great wise ones display

source: །ཆོ་འཕྲུལ་བསམ་གྱིས་མི་ཁྱབ་སྟོན།
en: Inconceivable miracles. {71}

source: །ཞིང་རྣམས་བྱེ་བ་གཡོ་བྱེད་དེ།
en: “They shake millions of realms

source: །གང་གཱ་ཡི་ནི་བྱེ་མ་སྙེད།
en: As numerous as the Ganges sands.

source: །དེ་དག་བདུད་རྣམས་ཕམ་བྱས་ནས།
en: They defeat the māras

source: །སངས་རྒྱས་གྲགས་པ་ཆེན་པོར་འགྱུར།
en: And are greatly famed buddhas. {72}

source: །དེ་དག་ཞིང་རྣམས་སྤྲུལ་བྱེད་དེ།
en: “They manifest trees

source: །རིན་པོ་ཆེ་ཡིས་རྣམ་པར་བརྒྱན།
en: Adorned with jewels,

source: །མེ་ཏོག་འབྲས་བུ་ཕུན་སུམ་ཚོགས། །དྲི་དང་ལྡན་ཞིང་ཡིད་དུ་འོང་།
en: Aromatic and beautiful, Bearing flowers and fruits. {73} “Those heroes emanate

source: །ཁང་པ་དང་ནི་གཞལ་མེད་ཁང་།
en: Delightful mansions,

source: །ཁང་པ་བརྩེགས་པ་པུ་ཤུར་བཅས། །དཔའ་བོ་དེ་དག་སྤྲུལ་པ་བྱེད།
en: Palaces and pinnacled halls,

source: །རྫིང་བུ་ཡིད་དུ་འོང་བ་དག །ཡན་ལག་བརྒྱད་ལྡན་ཆུ་ཡིས་གང་།
en: And beautiful lotus ponds {74} “Filled with water that has the eight qualities,

source: །དང་ཞིང་བསིལ་ལ་རྙོག་པ་མེད།
en: That is clear, cool, and unstained.

source: །དེ་ལས་ཆུ་ནི་སུས་འཐུངས་པ།
en: Those who drink that water

source: །སྲིད་པ་གསུམ་ཡང་སྤོང་བར་འགྱུར།
en: Cease yearning for the three existences. {75}

source: །བླ་ན་མེད་པའི་ཆུ་འཐུངས་ནས། །དེ་དག་ཕྱིར་ཡང་མི་ལྡོག་འགྱུར།
en: “They become irreversible, Those who drink that supreme water.

source: །བླ་མེད་ཞི་བའི་འཇུག་པར་ནི། །འགྲོ་བར་ཤིན་ཏུ་རིག་པར་གྱིས།
en: The supreme way of peace.

source: །འཇུག་པ་འདི་ནི་མི་ཤེས་པས།
en: Those who do not know that way,

source: །དམིགས་པ་ཅན་དག་ཤིན་ཏུ་བརླག །སུ་དག་དེ་ལ་རྟེན་གྱུར་ཅིང་།
en: Those focused on perceptions, will perish. {77}

source: །དེ་དག་སྐལ་མཉམ་སེམས་ཅན་དེ།
en: “The beings who follow that way,

source: །མནར་མེད་པར་ནི་དེ་འགྲོ་སྟེ།
en: And those who depend upon them,

source: །མི་བཟད་པ་ནི་ཆེན་པོར་ལྟུང་།
en: Will fall into the great terror Of unendurable Avīci. {78}

source: །དེ་ཡི་སྡུག་བསྔལ་དྲག་པོ་ནི།
en: “The terrible sufferings there

source: །བརྗོད་པར་ནུས་པ་མ་ཡིན་ཏེ།
en: Are beyond description,

source: །བྱང་ཆུབ་སེམས་དཔའ་སྐྱོབ་པ་དང་། །ངས་ནི་དེ་དག་རབ་ཏུ་ཤེས།
en: But I and the bodhisattvas, The protectors, know them. {79} “They doubt the Dharma,

source: །འདི་འདྲའི་ཟབ་མོ་མཐོང་དཀའ་ཡི། །ཆོས་ལ་སུ་དག་ནེམ་ནུར་བྱེད། །སུ་དག་དམིགས་ལ་གནས་པ་ཡི།
en: Which is profound and difficult to see.

source: །བྱིས་པ་དག་གི་ས་མ་ཡིན། །བླ་མེད་སངས་རྒྱས་ཞིང་དུ་ནི།
en: It is not on the level of fools,

source: །གང་གིས་དེ་དག་འགྲོ་འགྱུར་བ།
en: Those who remain focused on perceptions. {80}

source: །གཟུགས་སྟོན་པ་ནི་དུ་མ་ཡི།
en: “The manifestations of displays, Of appearances of many forms,

source: །བཀོད་པ་དག་ནི་སྤྲུལ་པར་བྱེད།
en: They are all of them seen in

source: །སངས་རྒྱས་ཞིང་ནི་ཇི་སྙེད་ཀྱི།
en: The supreme buddha realms. {81}

source: །གཟུགས་འགྲུབ་ཕུན་སུམ་ཚོགས་ཡོད་པ།
en: “All the appearances of manifested forms

source: །དེ་དག་ཐམས་ཅད་འདིར་ཡང་ནི། །བྱང་ཆུབ་སེམས་དཔའ་འཕྲུལ་ཆེ་སྟོན།
en: That are in every buddha realm Are all revealed here by bodhisattvas With great miraculous powers. {82} “Those great heroes with great strength

source: །ཆོས་ཆེན་གྱི་ནི་གོ་བགོས་ཏེ།
en: Wear the armor of the great Dharma. They strike with the blows

source: །དཔའ་ཆེན་སྟོབས་ཀྱང་ཆེ་བ་དག །སྟོང་པའི་དོན་ཆེན་རྡོ་རྗེ་ཡིས། །གདབ་པ་དག་ཀྱང་དེ་དག་འདེབས།
en: Of the great vajra of the meaning of emptiness. {83}

source: །འོད་ཟེར་བྱེ་བ་ཕྲག་སྟོང་དག །གང་གཱ་ཡི་ནི་བྱེ་མ་སྙེད།
en: “Many thousands of millions of light rays As numerous as the sands in the Ganges

source: །དེ་ཡི་ལུས་ལས་འབྱུང་བར་འགྱུར།
en: Are radiated from their bodies

source: །དེས་ནི་འཇིག་རྟེན་རབ་ཏུ་སྣང་།
en: And they illuminate the world. {84}

source: །དེ་དག་བུད་མེད་མི་ཆགས་ཏེ།
en: “They find no pleasure in women And have no desire for them.

source: །དེ་དག་ཡིད་འབྱུང་མི་བྱེད་ལ།
en: Those conceptions have been destroyed

source: །བུད་མེད་འདུ་ཤེས་རང་བཞིན་གྱིས། །འདུ་ཤེས་དེ་དག་རྣམ་པར་བཤིག །དཔའ་བོ་དེ་དག་གར་གནས་པ།
en: Naturally with their conceptions of women. {85} “Wherever those heroes are present,

source: །སངས་རྒྱས་ཞིང་དེ་མི་སྟོང་སྟེ།
en: Those buddha realms are not empty.

source: །དེ་དག་ལ་ནི་སྡིག་ཅན་བདུད།
en: How could the māras and evil ones

source: །བར་ཆད་བྱེད་པར་ག་ལ་འགྱུར།
en: Create an obstacle for them? {86}

source: །ལྟ་བ་དག་ལ་དེ་གནས་པས།
en: “Those who remain in fabricated views

source: །སངས་རྒྱས་མང་པོ་མཉེས་མ་བྱས།
en: Displease a multitude of buddhas.

source: །གནོད་སེམས་ཀྱིས་ནི་ཉེར་བརྟན་ཅིང་།
en: Those who are based upon maliciousness

source: །འདོད་དང་ཆགས་ལ་རབ་ཏུ་གནས།
en: Maintain their desires and attachments. {87}

source: །ལྟ་ལ་གནས་པ་དེ་དག་ཀུན།
en: “All of those who maintain those views

source: །བདུད་ཡིན་པར་ནི་རིག་པར་བྱ།
en: Should be known to be māras.

source: །དེ་ལ་སྡིག་ཅན་བདུད་རྣམས་ཀྱང་།
en: But those māras and evil ones

source: །བར་ཆད་བྱེད་པར་མི་འཇུག་གོ།
en: Cannot cause them an obstacle. {i} “When all conceptualization has ceased

source: །ཡེ་ཤེས་དེ་ལྟར་སུས་ཤེས་པ། །འདུ་ཤེས་ཐམས་ཅད་རྣམ་བཤིག་ནས།
en: That is how one should know wisdom to be,

source: །འདུ་ཤེས་དག་པ་མི་ལྡོག་གནས།
en: The inconceivable wisdom of buddhahood. {88}

source: །ད་ལྟར་མཐའ་ཡང་མཐོང་བར་འགྱུར།
en: And also the present.

source: །དེ་ལྟར་ཆོས་རྣམས་བསྟན་མོད་ཀྱི།
en: Phenomena are revealed in that way,

source: །དེ་ལ་ཆུང་ཟད་བསྟན་པ་མེད།
en: But there is nothing to be revealed. {89}

source: །ཡེ་ཤེས་ཀྱིས་ཀྱང་ཤེས་པ་མེད།
en: “They do not know through knowledge.

source: །མི་ཤེས་པས་ཀྱང་ཞུམ་མི་འགྱུར།
en: They are not despondent because of no knowledge.

source: །ཡེ་ཤེས་མི་ཤེས་རྣམ་བརྟགས་ནས།
en: When knowledge and no knowledge have been examined

source: །སངས་རྒྱས་ཡེ་ཤེས་བརྗོད་པ་ཡིན།
en: That is what is said to be ‘the knowledge of buddhahood.’ {90}

source: །རྣམ་རིག་ཚིག་དང་བརྡ་རྣམས་ནི། །བྱང་ཆུབ་སེམས་དཔས་རབ་ཏུ་ཤེས། །དེ་ནི་སེམས་ཅན་དོན་རྣམས་ཀྱང་།
en: “The bodhisattvas know Communication, words, and terms,

source: །དཔག་མེད་བསམ་ཡས་བྱེད་པར་འགྱུར།
en: And they accomplish immeasurable, Inconceivable benefits for beings. {91}

source: །འདུ་ཤེས་ཀུན་ཏུ་ཤེས་པའི་ཕྱིར།
en: “In order for a concept to be known,

source: །འཛིན་པར་ཡང་ནི་དེ་བསྟན་ཏེ།
en: It is taught through grasping.

source: །འདུ་ཤེས་དེ་ནི་མི་འཛིན་པ།
en: The non-grasping of a concept

source: །དབེན་པའི་དོན་དུ་རབ་ཏུ་བསྟན།
en: Is taught for the sake of detachment. {92}

source: །དབེན་པ་གང་ཡིན་འདུ་ཤེས་ཏེ།
en: “That which is detachment is taught

source: །འདུ་ཤེས་གང་ཡིན་བསྟན་པ་དེ།
en: To be detachment from conceptions.

source: །འདུ་ཤེས་རང་བཞིན་ཡེ་ཤེས་ཏེ།
en: As the nature of conceptions is known,

source: །དེ་ལྟར་འདུ་ཤེས་མེད་པར་འགྱུར།
en: There will be no conceptions. {93} “When someone has the conception

source: །འདུ་ཤེས་འདི་ནི་སྤང་སྙམ་དུ། །གང་གི་འདུ་ཤེས་འབྱུང་བ་ནི།
en: ‘I must eliminate this conception,’

source: །འདུ་ཤེས་སྤྲོས་ལ་སྤྱོད་པ་སྟེ།
en: They cause conceptions to increase,

source: །འདུ་ཤེས་ལས་ནི་དེ་མི་འཐར།
en: And they will not be free from conceptions. {94}

source: །སུ་ཡི་འདུ་ཤེས་འདི་དག་བྱུང་།
en: “For whom has this conception arisen?

source: །སུ་ཡིས་འདུ་ཤེས་འདི་བསྐྱེད་བྱས།
en: Who has made this conception arise?

source: །སུས་ནི་འདུ་ཤེས་རེག་པར་བྱས།
en: Who perceives this conception?

source: །སུས་ནི་འདུ་ཤེས་བཀག་པར་གྱུར།
en: Who ends this conception? {95}
